GopalSaraf/Practicals/PSDL/include/proc/pic16lf1574.inc
/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0
#define ABDOVF                           BANKMASK(BAUDCON), 7
#define ADCACTPPS0                       BANKMASK(ADCACTPPS), 0
#define ADCACTPPS1                       BANKMASK(ADCACTPPS), 1
#define ADCACTPPS2                       BANKMASK(ADCACTPPS), 2
#define ADCACTPPS3                       BANKMASK(ADCACTPPS), 3
#define ADCACTPPS4                       BANKMASK(ADCACTPPS), 4
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUDCON), 3
#define BRGH                             BANKMASK(TXSTA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2NCH2                           BANKMASK(CM2CON1), 2
#define C2OE                             BANKMASK(CM2CON0), 5
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 4
#define C2PCH1                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define CARRY                            BANKMASK(STATUS), 0
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(PMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CKPPS0                           BANKMASK(CKPPS), 0
#define CKPPS1                           BANKMASK(CKPPS), 1
#define CKPPS2                           BANKMASK(CKPPS), 2
#define CKPPS3                           BANKMASK(CKPPS), 3
#define CKPPS4                           BANKMASK(CKPPS), 4
#define CREN                             BANKMASK(RCSTA), 4
#define CSRC                             BANKMASK(TXSTA), 7
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1INPPS0                       BANKMASK(CWG1INPPS), 0
#define CWG1INPPS1                       BANKMASK(CWG1INPPS), 1
#define CWG1INPPS2                       BANKMASK(CWG1INPPS), 2
#define CWG1INPPS3                       BANKMASK(CWG1INPPS), 3
#define CWG1INPPS4                       BANKMASK(CWG1INPPS), 4
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DACEN                            BANKMASK(DACCON0), 7
#define DACLPS                           BANKMASK(DACCON0), 6
#define DACOE                            BANKMASK(DACCON0), 5
#define DACPSS0                          BANKMASK(DACCON0), 2
#define DACPSS1                          BANKMASK(DACCON0), 3
#define DACR0                            BANKMASK(DACCON1), 0
#define DACR1                            BANKMASK(DACCON1), 1
#define DACR2                            BANKMASK(DACCON1), 2
#define DACR3                            BANKMASK(DACCON1), 3
#define DACR4                            BANKMASK(DACCON1), 4
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define FERR                             BANKMASK(RCSTA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(CWG1CON2), 6
#define G1ASDLA0                         BANKMASK(CWG1CON1), 4
#define G1ASDLA1                         BANKMASK(CWG1CON1), 5
#define G1ASDLB0                         BANKMASK(CWG1CON1), 6
#define G1ASDLB1                         BANKMASK(CWG1CON1), 7
#define G1ASDSC1                         BANKMASK(CWG1CON2), 2
#define G1ASDSC2                         BANKMASK(CWG1CON2), 3
#define G1ASDSPPS                        BANKMASK(CWG1CON2), 1
#define G1ASE                            BANKMASK(CWG1CON2), 7
#define G1CS0                            BANKMASK(CWG1CON0), 0
#define G1EN                             BANKMASK(CWG1CON0), 7
#define G1IS0                            BANKMASK(CWG1CON1), 0
#define G1IS1                            BANKMASK(CWG1CON1), 1
#define G1IS2                            BANKMASK(CWG1CON1), 2
#define G1OEA                            BANKMASK(CWG1CON0), 5
#define G1OEB                            BANKMASK(CWG1CON0), 6
#define G1POLA                           BANKMASK(CWG1CON0), 3
#define G1POLB                           BANKMASK(CWG1CON0), 4
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define INTPPS0                          BANKMASK(INTPPS), 0
#define INTPPS1                          BANKMASK(INTPPS), 1
#define INTPPS2                          BANKMASK(INTPPS), 2
#define INTPPS3                          BANKMASK(INTPPS), 3
#define INTPPS4                          BANKMASK(INTPPS), 4
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(PMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MPWM1EN                          BANKMASK(PWMEN), 0
#define MPWM1LD                          BANKMASK(PWMLD), 0
#define MPWM1OUT                         BANKMASK(PWMOUT), 0
#define MPWM2EN                          BANKMASK(PWMEN), 1
#define MPWM2LD                          BANKMASK(PWMLD), 1
#define MPWM2OUT                         BANKMASK(PWMOUT), 1
#define MPWM3EN                          BANKMASK(PWMEN), 2
#define MPWM3LD                          BANKMASK(PWMLD), 2
#define MPWM3OUT                         BANKMASK(PWMOUT), 2
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define OERR                             BANKMASK(RCSTA), 1
#define OSTS                             BANKMASK(OSCSTAT), 5
#define PEIE                             BANKMASK(INTCON), 6
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWM1CS0                          BANKMASK(PWM1CLKCON), 0
#define PWM1CS1                          BANKMASK(PWM1CLKCON), 1
#define PWM1DCH0                         BANKMASK(PWM1DCH), 0
#define PWM1DCH1                         BANKMASK(PWM1DCH), 1
#define PWM1DCH2                         BANKMASK(PWM1DCH), 2
#define PWM1DCH3                         BANKMASK(PWM1DCH), 3
#define PWM1DCH4                         BANKMASK(PWM1DCH), 4
#define PWM1DCH5                         BANKMASK(PWM1DCH), 5
#define PWM1DCH6                         BANKMASK(PWM1DCH), 6
#define PWM1DCH7                         BANKMASK(PWM1DCH), 7
#define PWM1DCIE                         BANKMASK(PWM1INTE), 1
#define PWM1DCIF                         BANKMASK(PWM1INTF), 1
#define PWM1DCL0                         BANKMASK(PWM1DCL), 0
#define PWM1DCL1                         BANKMASK(PWM1DCL), 1
#define PWM1DCL2                         BANKMASK(PWM1DCL), 2
#define PWM1DCL3                         BANKMASK(PWM1DCL), 3
#define PWM1DCL4                         BANKMASK(PWM1DCL), 4
#define PWM1DCL5                         BANKMASK(PWM1DCL), 5
#define PWM1DCL6                         BANKMASK(PWM1DCL), 6
#define PWM1DCL7                         BANKMASK(PWM1DCL), 7
#define PWM1EN                           BANKMASK(PWM1CON), 7
#define PWM1EN_A                         BANKMASK(PWMEN), 0
#define PWM1IE                           BANKMASK(PIE3), 4
#define PWM1IF                           BANKMASK(PIR3), 4
#define PWM1LD                           BANKMASK(PWM1LDCON), 7
#define PWM1LDA_A                        BANKMASK(PWMLD), 0
#define PWM1LDM                          BANKMASK(PWM1LDCON), 6
#define PWM1LDS0                         BANKMASK(PWM1LDCON), 0
#define PWM1LDS1                         BANKMASK(PWM1LDCON), 1
#define PWM1MODE0                        BANKMASK(PWM1CON), 2
#define PWM1MODE1                        BANKMASK(PWM1CON), 3
#define PWM1OE                           BANKMASK(PWM1CON), 6
#define PWM1OFH0                         BANKMASK(PWM1OFH), 0
#define PWM1OFH1                         BANKMASK(PWM1OFH), 1
#define PWM1OFH2                         BANKMASK(PWM1OFH), 2
#define PWM1OFH3                         BANKMASK(PWM1OFH), 3
#define PWM1OFH4                         BANKMASK(PWM1OFH), 4
#define PWM1OFH5                         BANKMASK(PWM1OFH), 5
#define PWM1OFH6                         BANKMASK(PWM1OFH), 6
#define PWM1OFH7                         BANKMASK(PWM1OFH), 7
#define PWM1OFIE                         BANKMASK(PWM1INTE), 3
#define PWM1OFIF                         BANKMASK(PWM1INTF), 3
#define PWM1OFL0                         BANKMASK(PWM1OFL), 0
#define PWM1OFL1                         BANKMASK(PWM1OFL), 1
#define PWM1OFL2                         BANKMASK(PWM1OFL), 2
#define PWM1OFL3                         BANKMASK(PWM1OFL), 3
#define PWM1OFL4                         BANKMASK(PWM1OFL), 4
#define PWM1OFL5                         BANKMASK(PWM1OFL), 5
#define PWM1OFL6                         BANKMASK(PWM1OFL), 6
#define PWM1OFL7                         BANKMASK(PWM1OFL), 7
#define PWM1OFM0                         BANKMASK(PWM1OFCON), 5
#define PWM1OFM1                         BANKMASK(PWM1OFCON), 6
#define PWM1OFMC                         BANKMASK(PWM1OFCON), 4
#define PWM1OFS0                         BANKMASK(PWM1OFCON), 0
#define PWM1OFS1                         BANKMASK(PWM1OFCON), 1
#define PWM1OUT                          BANKMASK(PWM1CON), 5
#define PWM1OUT_A                        BANKMASK(PWMOUT), 0
#define PWM1PHH0                         BANKMASK(PWM1PHH), 0
#define PWM1PHH1                         BANKMASK(PWM1PHH), 1
#define PWM1PHH2                         BANKMASK(PWM1PHH), 2
#define PWM1PHH3                         BANKMASK(PWM1PHH), 3
#define PWM1PHH4                         BANKMASK(PWM1PHH), 4
#define PWM1PHH5                         BANKMASK(PWM1PHH), 5
#define PWM1PHH6                         BANKMASK(PWM1PHH), 6
#define PWM1PHH7                         BANKMASK(PWM1PHH), 7
#define PWM1PHIE                         BANKMASK(PWM1INTE), 2
#define PWM1PHIF                         BANKMASK(PWM1INTF), 2
#define PWM1PHL0                         BANKMASK(PWM1PHL), 0
#define PWM1PHL1                         BANKMASK(PWM1PHL), 1
#define PWM1PHL2                         BANKMASK(PWM1PHL), 2
#define PWM1PHL3                         BANKMASK(PWM1PHL), 3
#define PWM1PHL4                         BANKMASK(PWM1PHL), 4
#define PWM1PHL5                         BANKMASK(PWM1PHL), 5
#define PWM1PHL6                         BANKMASK(PWM1PHL), 6
#define PWM1PHL7                         BANKMASK(PWM1PHL), 7
#define PWM1POL                          BANKMASK(PWM1CON), 4
#define PWM1PRH0                         BANKMASK(PWM1PRH), 0
#define PWM1PRH1                         BANKMASK(PWM1PRH), 1
#define PWM1PRH2                         BANKMASK(PWM1PRH), 2
#define PWM1PRH3                         BANKMASK(PWM1PRH), 3
#define PWM1PRH4                         BANKMASK(PWM1PRH), 4
#define PWM1PRH5                         BANKMASK(PWM1PRH), 5
#define PWM1PRH6                         BANKMASK(PWM1PRH), 6
#define PWM1PRH7                         BANKMASK(PWM1PRH), 7
#define PWM1PRIE                         BANKMASK(PWM1INTE), 0
#define PWM1PRIF                         BANKMASK(PWM1INTF), 0
#define PWM1PRL0                         BANKMASK(PWM1PRL), 0
#define PWM1PRL1                         BANKMASK(PWM1PRL), 1
#define PWM1PRL2                         BANKMASK(PWM1PRL), 2
#define PWM1PRL3                         BANKMASK(PWM1PRL), 3
#define PWM1PRL4                         BANKMASK(PWM1PRL), 4
#define PWM1PRL5                         BANKMASK(PWM1PRL), 5
#define PWM1PRL6                         BANKMASK(PWM1PRL), 6
#define PWM1PRL7                         BANKMASK(PWM1PRL), 7
#define PWM1PS0                          BANKMASK(PWM1CLKCON), 4
#define PWM1PS1                          BANKMASK(PWM1CLKCON), 5
#define PWM1PS2                          BANKMASK(PWM1CLKCON), 6
#define PWM1TMRH0                        BANKMASK(PWM1TMRH), 0
#define PWM1TMRH1                        BANKMASK(PWM1TMRH), 1
#define PWM1TMRH2                        BANKMASK(PWM1TMRH), 2
#define PWM1TMRH3                        BANKMASK(PWM1TMRH), 3
#define PWM1TMRH4                        BANKMASK(PWM1TMRH), 4
#define PWM1TMRH5                        BANKMASK(PWM1TMRH), 5
#define PWM1TMRH6                        BANKMASK(PWM1TMRH), 6
#define PWM1TMRH7                        BANKMASK(PWM1TMRH), 7
#define PWM1TMRL0                        BANKMASK(PWM1TMRL), 0
#define PWM1TMRL1                        BANKMASK(PWM1TMRL), 1
#define PWM1TMRL2                        BANKMASK(PWM1TMRL), 2
#define PWM1TMRL3                        BANKMASK(PWM1TMRL), 3
#define PWM1TMRL4                        BANKMASK(PWM1TMRL), 4
#define PWM1TMRL5                        BANKMASK(PWM1TMRL), 5
#define PWM1TMRL6                        BANKMASK(PWM1TMRL), 6
#define PWM1TMRL7                        BANKMASK(PWM1TMRL), 7
#define PWM2CS0                          BANKMASK(PWM2CLKCON), 0
#define PWM2CS1                          BANKMASK(PWM2CLKCON), 1
#define PWM2DCH0                         BANKMASK(PWM2DCH), 0
#define PWM2DCH1                         BANKMASK(PWM2DCH), 1
#define PWM2DCH2                         BANKMASK(PWM2DCH), 2
#define PWM2DCH3                         BANKMASK(PWM2DCH), 3
#define PWM2DCH4                         BANKMASK(PWM2DCH), 4
#define PWM2DCH5                         BANKMASK(PWM2DCH), 5
#define PWM2DCH6                         BANKMASK(PWM2DCH), 6
#define PWM2DCH7                         BANKMASK(PWM2DCH), 7
#define PWM2DCIE                         BANKMASK(PWM2INTE), 1
#define PWM2DCIF                         BANKMASK(PWM2INTF), 1
#define PWM2DCL0                         BANKMASK(PWM2DCL), 0
#define PWM2DCL1                         BANKMASK(PWM2DCL), 1
#define PWM2DCL2                         BANKMASK(PWM2DCL), 2
#define PWM2DCL3                         BANKMASK(PWM2DCL), 3
#define PWM2DCL4                         BANKMASK(PWM2DCL), 4
#define PWM2DCL5                         BANKMASK(PWM2DCL), 5
#define PWM2DCL6                         BANKMASK(PWM2DCL), 6
#define PWM2DCL7                         BANKMASK(PWM2DCL), 7
#define PWM2EN                           BANKMASK(PWM2CON), 7
#define PWM2EN_A                         BANKMASK(PWMEN), 1
#define PWM2IE                           BANKMASK(PIE3), 5
#define PWM2IF                           BANKMASK(PIR3), 5
#define PWM2LD                           BANKMASK(PWM2LDCON), 7
#define PWM2LDA_A                        BANKMASK(PWMLD), 1
#define PWM2LDM                          BANKMASK(PWM2LDCON), 6
